In [49]:
import numpy as np
import pandas as pd
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

# 1. Cách tạo ra data frame

In [50]:
data = np.random.rand(4, 5) * 20 + 10
row_index = ['A', 'B', 'C', 'D', 'E']
column_index = ['X', 'Y', 'Z', 'K']
data_frame = pd.DataFrame(data, column_index, row_index)
data_frame

           A          B          C          D          E
X  16.310154  29.979989  15.387303  17.680391  19.379069
Y  29.241065  22.197499  20.902615  29.446037  19.086410
Z  11.463713  24.141955  13.737077  22.893057  24.121437
K  20.680222  19.990838  28.207043  14.515059  19.934048

# 2. Lấy 1 cột, 1 hàng

In [51]:
data_frame['A']

X    16.310154
Y    29.241065
Z    11.463713
K    20.680222
Name: A, dtype: float64

In [52]:
data_frame.loc['Z']
data_frame.iloc[2]

A    11.463713
B    24.141955
C    13.737077
D    22.893057
E    24.121437
Name: Z, dtype: float64

A    11.463713
B    24.141955
C    13.737077
D    22.893057
E    24.121437
Name: Z, dtype: float64

# 3. Lấy nhiều cột, nhiều hàng liên tục

In [53]:
data_frame[['A', 'B']]

           A          B
X  16.310154  29.979989
Y  29.241065  22.197499
Z  11.463713  24.141955
K  20.680222  19.990838

In [54]:
data_frame.loc[['X', 'Z']]

           A          B          C          D          E
X  16.310154  29.979989  15.387303  17.680391  19.379069
Z  11.463713  24.141955  13.737077  22.893057  24.121437

# 4. Lấy 1 khối hàng, cột

In [55]:
data_frame.loc[['Y', 'Z'], ['C', 'D']]

           C          D
Y  20.902615  29.446037
Z  13.737077  22.893057

# 5. Tạo cột mới

In [56]:
data_frame['Sum'] = data_frame['A'] + data_frame['B']
data_frame

           A          B          C          D          E        Sum
X  16.310154  29.979989  15.387303  17.680391  19.379069  46.290142
Y  29.241065  22.197499  20.902615  29.446037  19.086410  51.438564
Z  11.463713  24.141955  13.737077  22.893057  24.121437  35.605668
K  20.680222  19.990838  28.207043  14.515059  19.934048  40.671060

# 6. Xoá cột/hàng

In [57]:
data_frame.drop('Sum', axis=1, inplace=True)
# axis: 1 là cột, 0 là hàng
# inplace: True là xoá luôn, False là xoá tạm thời
data_frame

           A          B          C          D          E
X  16.310154  29.979989  15.387303  17.680391  19.379069
Y  29.241065  22.197499  20.902615  29.446037  19.086410
Z  11.463713  24.141955  13.737077  22.893057  24.121437
K  20.680222  19.990838  28.207043  14.515059  19.934048